---
layout: post
title: 基因组重测序
category: bioinfomatics
tags: [basic]
---

## 什么是全基因组重测序## 

全基因组重测序是对已知基因组序列的物种进行不同个体的基因组测序，并在此基础上对个体或群体进行差异性分析。全基因组重测序的个体，通过序列比对，可以找到大量的单核苷酸多态性位点（SNP），插入缺失位点（InDel，Insertion/Deletion）、结构变异位点（SV，Structure Variation）位点和拷贝数变异位点（CNV，copy number variation)。SBC可以协助客户，通过生物信息手段，分析不同个体基因组间的结构差异， 同时完成注释。

随着基因组测序成本的不断降低，人类疾病的致病突变研究由外显子区域扩大到全基因组范围，通过构建全基因组文库，实现在全基因组水平上检测疾病关联的常见、低频、甚至是罕见的突变位点，以及结构变异等，具有重大的科研和产业价值。

'''

我们使用的基因组是怎么来的？通过Denovo测序，也就是从头测序，拼接得到基因组

那么重测序呢？已有的基因组发表出来以后，重新进行测序就不需要拼接，直接可以对测序reads进行短序列比对。简而言之就是对基因组序列已知的物种个体进行基因组测序。本质就是找变异。

通过这种方法，可以比较个体或者群体差异，建立该物种的变异数据库，挖掘重要性状的关键候选基因。利用重测序可以进行变异检测(SNP Calling)、遗传图谱构建、群体进化以及全基因组关联分析（GWAS）。

'''

由于基因组的测序覆盖度不同，可分为全基因组重测序和简化基因组重测序。全基因组重测序（WGS）是在全基因组水平上检测动植物重要性状相关的变异位点，可以检测SNP(单核苷酸多态性)、InDel（小片段插入缺失）、SV（结构变异）、CNV（拷贝数变异）、转座子变异等。

简化基因组测序（GBS, Genotyping by Sequencing） 将基因组DNA进行酶切，然后对酶切片段序列进行测序，一般能捕获全基因组的1%序列，主要用于检测SNP，成本低适合大规模样品标记筛选。

## 参考文献 ##

* [百度知识](https://baike.baidu.com/item/%E5%85%A8%E5%9F%BA%E5%9B%A0%E7%BB%84%E9%87%8D%E6%B5%8B%E5%BA%8F)
